src/wsman_ping_enable

<?xml version="1.0" encoding="utf-8"?><Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.w3.org/2003/05/soap-envelope"><Header><Action xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://schemas.xmlsoap.org/ws/2004/09/transfer/Put</Action><To xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://192.168.0.100:16992/wsman</To><ResourceURI xmlns="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">http://intel.com/wbem/wscim/1/amt-schema/1/AMT_GeneralSettings</ResourceURI><MessageID xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">3678918f-71fd-4a40-bb17-81bff747100c</MessageID><ReplyTo xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing"><Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</Address></ReplyTo><OperationTimeout xmlns="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60.000S</OperationTimeout><wsman:SelectorSet xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"><wsman:Selector Name="InstanceID">Intel(r) AMT: General Settings</wsman:Selector></wsman:SelectorSet></Header><Body><g:AMT_GeneralSettings xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_GeneralSettings">
<g:InstanceID>Intel(r) AMT: General Settings</g:InstanceID>
<g:PingResponseEnabled>true</g:PingResponseEnabled>
</g:AMT_GeneralSettings>
</Body></Envelope>
